# -----------------------------
# Language Info (Ukrainian)
# -----------------------------
LANG = "🇺🇦 Українська"
CODE = "UK-UA"

# -----------------------------
# Telegram Messages
# -----------------------------
peer_id_error = (
    "<b>❗Виникла помилка при відправленні подарунка!</b>\n\n"
    "Будь ласка, переконайтеся, що ініціалізація чату прошла успішно, "
    "ви раніше взаємодіяли з цим користувачем, <b><i>і що ви не відправляєте подарунок самі собі!</i></b>\n\n"
    "⚠️ Якщо нічого не допомагає, спробуйте додати користувача(-ів) у контакти або напишіть розробнику: @B7XX7B"
)

error_message = "<b>❗Помилка при купівлі подарунка!</b>\n\n<pre>{}</pre>"

balance_error = ("<b>🎁 Подарунок</b> [<code>{}</code>] не був надісланий через недостатній баланс!"
                 "\n\n<b>❗ Поповніть баланс, щоб продовжити надсилати подарунки.</b>")

usage_limited = "<b>❗Лімітований подарунок</b> [<code>{}</code>] закінчився."

non_limited_error = "<b>❗Подарунок</b> [<code>{}</code>] не лімітований. Пропускаємо згідно з Вашими налаштуваннями..."

gift_price = "<b>🎁 Подарунок</b> [<code>{}</code>] не відповідає налаштуванням користувача\n\n Ціна: <b>{} ⭐ | саплай: {}</b>. Пропускаємо..."

success_message = "<b>🎁 Подарунок ({}/{}):</b> [<code>{}</code>] успішно надіслано!\n\n<b>Отримувач:{}</b> "

# -----------------------------
# Console Messages
# -----------------------------
low_balance = "Недостатньо зірок на балансі для надсилання подарунка!"
out_of_stock = "Лімітованого подарунка: {} Немає в наявності."
peer_id = "Переконайтеся, що ви раніше взаємодіяли з цим користувачем або не надсилаєте подарунок самі собі!"
gift_send_error = "Не вдалося надіслати подарунок: {} користувачу: {}"
gift_checking = "Перевірка нових подарунків"
new_gifts = "Знайдено нові подарунки:"
gift_expensive = "Подарунок: \033[1m{}\033[0m не відповідає налаштуванням користувача, ціна: {}★ | саплай: {}"
non_limited_gift = "Подарунок: \033[1m{}\033[0m не лімітований. Пропускаємо..."
purchase_error = "Помилка при купівлі подарунка \033[1m{}\033[0m для користувача: \033[1m{}\033[0m"
terminated = "Програма завершила свою роботу"
unexpected_error = "Сталася непередбачена помилка:"

gift_sent = "Подарунок ({}/{}): \033[1m{}\033[0m успішно надіслано до {}"
